

# 清醒的人最荒唐

```c
why will produce memory fragments  with malloc frequently 

Memory fragmentation occurs when the free memory space on a system becomes fragmented into small pieces due to the allocation and deallocation of memory blocks of varying sizes. This can lead to a situation where a program is unable to allocate a sufficiently large contiguous block of memory, even though the total amount of free memory is sufficient.

One reason why memory fragmentation can occur frequently when using malloc is that malloc allocates memory dynamically, and the size of the memory block allocated is not necessarily the same as the size requested. This can result in small gaps or "holes" in the memory space that are not large enough to be reused for future memory allocations. Over time, these holes can accumulate and cause memory fragmentation.

Another reason is that malloc relies on the operating system's memory allocation mechanism to provide memory blocks, and the behavior of the operating system's allocator can vary depending on the specific system and usage patterns. For example, some operating systems may be more likely to fragment memory than others, and the frequency and size of allocations and deallocations can also affect the likelihood of fragmentation.


	d(vfptr):指的是访问对象d的虚函数表的前四个字节，前四个字节的内容是RTTI。
	*/
	cout << typeid(*pb).name() << endl; //class Derive    *pb的类型是Derive
	system("pause");
	return 0;
}
```

运行结果：

```c
Derive::show()   //虚函数，调子类的
Base::show(int)  //不是虚函数且子类没有重写，因为是Base*类型的指针，所以调用父类的。
8
12
class Base *
class Derive
请按任意键继续. . .
```

我们理解简单一点：只要类中有虚函数，那么这个虚函数执行的就是动态绑定。

此时有三种情况：（==前提是继承关系已经存在==）

1. **==父类指针指向了子类对象==**

   1. **==如果子类重写(覆盖)了父类的这个虚函数，那么肯定调用子类重写的这个虚函数。(只有这个是多态)==**
   2. 如果子类没有重写父类的这个虚函数，那么肯定调用父类中的这个虚函数。

2. **==父类指针指向的是父类对象，那么动态绑定仍旧发生==**，只是最后肯定调用的是父类中的这个虚函数。

   此时重写不重写都不重要了。

3. 子类指针指向的是子类对象。

   1. 若重写了，调用子类的。
   2. **==若没重写，调用父类的，因为虚函数指针和虚函数表都是一起继承下来的。==**



**==至于抽象类：抽象类的所有`纯虚函数`都得重写，抽象类不能实例化对象，分析起来省事多了！！！==**

**==当然，抽象类是肯定可以包含普通函数和虚函数和成员变量的。==**

示例：

```c++
#include<iostream>
using namespace std;
#include<string>
class Base   //抽象类
{
public:
	Base(int data=10):ma(data){ }
	virtual void show() = 0;   //纯虚函数
	virtual void show(int) { cout << "抽象类可以有虚函数并且不一定要被重写" << endl; }
	void print() { cout << "抽象类可以有普通函数" << endl; }
protected:
	int ma;
};

class Derive:public Base
{
public:
	Derive(int data = 20) :Base(data),mb(data){ }
	void show() { cout << "抽象类的纯虚函数必须被重写" << endl; }
protected:
	int mb;
};
int main()
{
	Derive d(50);
	Base* pb = &d;
	pb->show();  
	pb->show(10); 
	pb->print();
	cout << sizeof Base << endl;     //4 8
	cout << sizeof Derive << endl;   //8 12
	system("pause");
	return 0;
}
```

运行结果：

![1632986198281](assets/1632986198281.png)

### 4.16 理清类的内存布局

首先，我们在Visual Studio 2022中

![image-20220828194049253](assets/image-20220828194049253.png)

然后右键选择属性：

![image-20220828194144163](assets/image-20220828194144163.png)

然后在其他选项这里写上`/d1 reportAllClassLayout`，它可以看到所有相关类的内存布局，如果写上`/d1 reportSingleClassLayoutXXX（XXX为类名）`，则只会打出指定类XXX的内存布局。近期的VS版本都支持这样配置。

例子：

![image-20220828194501115](assets/image-20220828194501115.png)

这段代码能够通过编译，不需要引入任何头文件。当然了，main函数是必要的，因为做完main函数之前的动作，程序需要调用main函数。

然后我们点击生成解决方案，我们就能够看到类的内存布局。当然还有较少的冗余信息，这就是为什么不引入头文件的原因，那样会大量生成不想要的无关类信息。

![image-20220828194723908](assets/image-20220828194723908.png)

可以看到A，B类都没有任何变量，所以大小为1，即使B类继承了A类，因为没有虚这个字的影响，所以大小也是为1。

***

先引入一些基础知识：

成员函数的地址，在编译期或运行时(指虚函数)确定，静态或动态地绑定在对象上。
**非虚函数，是静态绑定的，==可以通过this指针访问到其在代码段中的地址==，故不需要在对象的内存中存储非虚函数的地址**；
**虚函数，是通过虚表动态绑定的，对象内存中有虚表地址，故也不需要在对象内存中保存虚函数地址**。



1. 虚函数表属于类，类的所有对象共享这个类的虚函数表。
2. 虚函数表由编译器在编译时生成并依据虚函数的个数来确定其大小，保存在.rodata只读数据段，很显然，它是一个数组。

**只要包含虚函数的类就会有一个虚函数表，当这个类是基类时，它的派生类也会有相应的虚函数表。当一个类有多个对象的时候，这些对象共享一个虚函数表。**



虚函数的一种使用是通过虚函数表实现的，所以不可避免的在内存与速度方面都会有影响：

每个对象的大小都会增大一个存储地址的空间，用来存放隐藏成员代表指向的地址。
对于每个含有虚函数的类，编译器都会创建一个虚函数表；
每次调用虚函数，都需要经历一次寻址过程，到虚函数表中寻找虚函数地址，耗费了时间。



**关于虚函数使用总结：
构造函数不能是虚函数。==当初始化派生类对象的时候，将调用派生类的构造函数，之后派生类的构造函数又会调用基类中的构造函数(先执行的还是基类构造函数)==，这种顺序不同于==继承机制(先调用子类中的函数，如果子类重写了的话)==，所以派生类不能继承基类的构造函数，因此将构造函数声明称虚函数没有用。**

析构函数应该声明为虚函数(还是得看情况，否则会引发虚函数指针带来内存的浪费)。前文讲过，不再赘述。
友元不能是虚函数，因为虚函数必须是成员函数，而友元不是成员类。但是友元函数可以使用虚函数。



下面可以定义一个最基础的类，像下面这样：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
};
int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(8):
1>	+---
1> 0	| a
1> 4	| b   //a占4字节，所以b的开始是4，一共8。
1>	+---
```

从这里可以看到普通类的排布方式，成员变量依据声明的顺序进行排列（类内偏移为0开始），成员函数不占内存空间。



再看下继承，往后面添加如下代码：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
};
class DerivedClass : public Base
{
    int c;
public:
    void DerivedCommonFunction();
};
int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(8):   //父类肯定不会发生变化噻
1>	+---
1> 0	| a
1> 4	| b
1>	+---
1>class DerivedClass	size(12):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | a
1> 4	| | b     
1>	| +---                //子类先继承父类的
1> 8	| c
1>	+---
```

可以看到子类继承了父类的成员变量，在内存排布上，先是排布了父类的成员变量，接着排布子类的成员变量，同样，成员函数不占字节。



下面给基类加上[虚函数](https://so.csdn.net/so/search?q=虚函数&spm=1001.2101.3001.7020)，暂时注释掉DerivedClass，看一下这时的内存排布：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
    void virtual VirtualFunction();
};
#if 0
class DerivedClass : public Base
{
    int c;
public:
    void DerivedCommonFunction();
};
#endif
int main()
{
    return 0;
}
```

内存布局(此时压根没有子类)：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:   //虚函数表开始
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
```

这个内存结构图分成了两个部分，上面是内存分布，下面是虚表，我们逐个看。VS所带编译器是把虚表指针放在了内存的开始处（0地址偏移，这样编译器找到虚表最容易），然后再是成员变量；

下面生成了虚表，紧跟在`&Base_meta`后面的0表示，这张虚表对应的虚指针在内存中的分布。下面列出了虚函数，**左侧的0是这个虚函数的序号，这里只有一个虚函数，所以只有一项，如果有多个虚函数，会有序号为1，为2的虚函数列出来**。

编译器是在构造函数创建这个虚表指针以及虚表的。

***那么编译器是如何利用虚表指针与虚表来实现多态的呢？***是这样的，**当创建一个含有虚函数的父类对象时，==编译器在构造函数里==将虚表指针指向虚表中父类的虚函数地址；当子类重写父类的虚函数，创建子类的对象时，==编译器在构造函数里==将虚表指针（子类的虚表指针，继承自父类），指向虚表中子类的虚函数地址**。

所以，如果是调用`Base* p = new Derived();`生成的是子类的对象，**==在构造时，子类对象的虚指针指向的是子类的虚表，接着由Derived到Base的转换并没有改变虚表指针==**，所以这时候`p->VirtualFunction`，实际上是`p->vfptr->VirtualFunction`，**==它在构造的时候就已经指向了子类的VirtualFunction，所以调用的是子类的虚函数，这就是多态了==**。

 简单说多态是一个接口不同实现,具体原理如上。



**下面加上子类，并在子类中添加虚函数**，像下面这样：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
    void virtual VirtualFunction();
};
class DerivedClass : public Base
{
    int c;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();  //子类覆写
};
int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
1>class DerivedClass	size(16):  //注意看子类
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}   //继承自父类的虚函数指针变量
1> 4	| | a
1> 8	| | b
1>	| +---
1>12	| c
1>	+---
1>DerivedClass::$vftable@:
1>	| &DerivedClass_meta
1>	|  0
1> 0	| &DerivedClass::VirtualFunction   //子类覆写，前面的DerivedClass说明了是子类的虚函数
1>DerivedClass::VirtualFunction this adjustor: 0
```

上**半部是内存分布，可以看到，虚表指针被继承了，且仍位于内存排布的起始处，下面是父类的成员变量a和b，最后是子类的成员变量c，注意虚表指针只有一个，子类并没有再生成虚表指针了**；下半部的虚表情况与父类是一样的。



我们把子类换个代码，像这样：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
    void virtual VirtualFunction();
};
class DerivedClass : public Base
{
    int c;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction2(); //子类新增虚函数
};
int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
1>class DerivedClass	size(16):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}
1> 4	| | a
1> 8	| | b
1>	| +---
1>12	| c
1>	+---
1>DerivedClass::$vftable@:
1>	| &DerivedClass_meta
1>	|  0
1> 0	| &Base::VirtualFunction  //没有覆写，前面的Base说明了是父类的虚函数
1> 1	| &DerivedClass::VirtualFunction2  //新增，肯定是子类的虚函数
1>DerivedClass::VirtualFunction2 this adjustor: 0
```

还是只有一个虚表指针，但是下方虚表的内容变化了，**虚表的0号是父类的VirtualFunction，而1号放的是子类的VirtualFunction2**。**==也就是说，如果定义了DerivedClass的对象，那么在构造时，虚表指针就会指向这个虚表==，以后如果调用的是VirtualFunction，那么会从父类中寻找对应的虚函数，如果调用的是VirtualFunction2，那么会从子类中寻找对应的虚函数**。



我们再改造一下子类，像这样：

```c
class DerivedClass : public Base
{
    int c;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();  //子类覆写虚函数
    void virtual VirtualFunction2(); //子类新增虚函数
};
```

我们既覆写父类的虚函数，也有新添的虚函数，那么可以料想的到，是下面的这种内存分布：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
1>class DerivedClass	size(16):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}
1> 4	| | a
1> 8	| | b
1>	| +---
1>12	| c
1>	+---
1>DerivedClass::$vftable@:
1>	| &DerivedClass_meta
1>	|  0
1> 0	| &DerivedClass::VirtualFunction    //子类覆写，前面的DerivedClass说明了是子类的虚函数
1> 1	| &DerivedClass::VirtualFunction2   //新增，肯定是子类的虚函数
1>DerivedClass::VirtualFunction this adjustor: 0   //从这里可以看出，子类覆写或新增都是产生了变化
1>DerivedClass::VirtualFunction2 this adjustor: 0  //变化会被记录
```

子类覆写或新增都是产生了变化。



下面来讨论多重继承(这里也是菱形继承)，代码如下：

```cpp
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
    void virtual VirtualFunction();
};


class DerivedClass1 : public Base
{
    int c;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();
};

class DerivedClass2 : public Base
{
    int d;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();
};

class DerivedDerivedClass : public DerivedClass1, public DerivedClass2
{
    int e;
public:
    void DerivedDerivedCommonFunction();
    void virtual VirtualFunction();
};

int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
    
1>class DerivedClass1	size(16):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}
1> 4	| | a
1> 8	| | b
1>	| +---
1>12	| c
1>	+---
1>DerivedClass1::$vftable@:
1>	| &DerivedClass1_meta
1>	|  0
1> 0	| &DerivedClass1::VirtualFunction   //子类覆写
1>DerivedClass1::VirtualFunction this adjustor: 0
    
1>class DerivedClass2	size(16):  //布局与DerivedClass1类似
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}
1> 4	| | a
1> 8	| | b
1>	| +---
1>12	| d
1>	+---
1>DerivedClass2::$vftable@:
1>	| &DerivedClass2_meta
1>	|  0
1> 0	| &DerivedClass2::VirtualFunction
1>DerivedClass2::VirtualFunction this adjustor: 0  //子类覆写
    
//以下是重点
1>class DerivedDerivedClass	size(36):
1>	+---
1> 0	| +--- (base class DerivedClass1)
1> 0	| | +--- (base class Base)
1> 0	| | | {vfptr}     //这里继承的Base的虚函数指针
1> 4	| | | a
1> 8	| | | b           //到这里都是Base的
1>	| | +---
1>12	| | c             //DerivedDerivedClass1的
1>	| +---
1>16	| +--- (base class DerivedClass2)
1>16	| | +--- (base class Base)
1>16	| | | {vfptr}   //这里偏移了DerivedClass1的大小为16。继承的也是Base的虚函数指针
1>20	| | | a
1>24	| | | b  //到这里都是Base的
1>	| | +---
1>28	| | d    //DerivedDerivedClass2的
    
1>	| +---
1>32	| e     //自己的
1>	+---
    
1>DerivedDerivedClass::$vftable@DerivedClass1@:  //虚表1
1>	| &DerivedDerivedClass_meta
1>	|  0
1> 0	| &DerivedDerivedClass::VirtualFunction
    
1>DerivedDerivedClass::$vftable@DerivedClass2@:  //虚表2
1>	| -16
1> 0	| &thunk: this-=16; goto DerivedDerivedClass::VirtualFunction
1>DerivedDerivedClass::VirtualFunction this adjustor: 0
//虽然有两个虚表，但终归是用了自己覆写的虚函数。那么选择的时候到底选哪一个虚表？
    
//以上是我为了观察手动分出了一些空行。
```

上面我们重点看看这个类`DerivedDerivedClass`，由外向内看，它并列地排布着继承而来的两个父类`DerivedClass1`与`DerivedClass2`，还有自身的成员变量`e`。`DerivedClass1`包含了它的成员变量c，以及`Base`，`Base`有一个0地址偏移的虚表指针，然后是成员变量a和b；`DerivedClass2`**的内存排布类似于DerivedClass1，注意到DerivedClass2里面竟然也有一份Base**。

这里有两份虚表了，分别针对DerivedClass1与DerivedClass2，在&DerivedDericedClass_meta下方的数字是首地址偏移量，靠下面的虚表的那个-16表示指向这个虚表的虚指针的内存偏移，这正是DerivedClass2中的{vfptr}在DerivedDerivedClass的内存偏移，因为DerivedClass1的大小为16。



如果采用虚继承，像下面这样：

```c
class Base
{
    int a;
    int b;
public:
    void CommonFunction();
    void virtual VirtualFunction();
};
class DerivedClass1 : virtual public Base
{
    int c;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();
};

class DerivedClass2 : virtual public Base
{
    int d;
public:
    void DerivedCommonFunction();
    void virtual VirtualFunction();
};

class DerivedDerivedClass : public DerivedClass1, public DerivedClass2
{
    int e;
public:
    void DerivedDerivedCommonFunction();
    void virtual VirtualFunction();
};

int main()
{
    return 0;
}
```

内存布局：

```c
1>class Base	size(12):
1>	+---
1> 0	| {vfptr}
1> 4	| a
1> 8	| b
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::VirtualFunction
1>Base::VirtualFunction this adjustor: 0
   
    
1>class DerivedClass1	size(20):
1>	+---
1> 0	| {vbptr}
1> 4	| c
1>	+---
1>	+--- (virtual base Base)
1> 8	| {vfptr}
1>12	| a
1>16	| b
1>	+---
1>DerivedClass1::$vbtable@:
1> 0	| 0
1> 1	| 8 (DerivedClass1d(DerivedClass1+0)Base)
1>DerivedClass1::$vftable@:
1>	| -8
1> 0	| &DerivedClass1::VirtualFunction
1>DerivedClass1::VirtualFunction this adjustor: 8
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>            Base       8       0       4 0
   
    
1>class DerivedClass2	size(20):
1>	+---
1> 0	| {vbptr}
1> 4	| d
1>	+---
1>	+--- (virtual base Base)
1> 8	| {vfptr}
1>12	| a
1>16	| b
1>	+---
1>DerivedClass2::$vbtable@:
1> 0	| 0
1> 1	| 8 (DerivedClass2d(DerivedClass2+0)Base)
1>DerivedClass2::$vftable@:
1>	| -8
1> 0	| &DerivedClass2::VirtualFunction
1>DerivedClass2::VirtualFunction this adjustor: 8
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>            Base       8       0       4 0
  
    
1>class DerivedDerivedClass	size(32):
1>	+---
1> 0	| +--- (base class DerivedClass1)
1> 0	| | {vbptr}
1> 4	| | c
1>	| +---
1> 8	| +--- (base class DerivedClass2)
1> 8	| | {vbptr}
1>12	| | d
1>	| +---
1>16	| e
1>	+---
1>	+--- (virtual base Base)
1>20	| {vfptr}
1>24	| a
1>28	| b
1>	+---
1>DerivedDerivedClass::$vbtable@DerivedClass1@:
1> 0	| 0
1> 1	| 20 (DerivedDerivedClassd(DerivedClass1+0)Base)
1>DerivedDerivedClass::$vbtable@DerivedClass2@:
1> 0	| 0
1> 1	| 12 (DerivedDerivedClassd(DerivedClass2+0)Base)
1>DerivedDerivedClass::$vftable@:
1>	| -20
1> 0	| &DerivedDerivedClass::VirtualFunction
1>DerivedDerivedClass::VirtualFunction this adjustor: 20
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>            Base      20       0       4 0
```

Base类没有变化，但往下看。

DerivedClass1就已经有变化了，原来是先排虚表指针与Base成员变量，vfptr位于0地址偏移处；但现在有两个虚表指针了，一个是vbptr，另一个是vfptr。vbptr是这个DerivedClass1对应的虚表指针，它指向DerivedClass1的虚表vbtable，另一个vfptr是虚基类表对应的虚指针，它指向vftable。

**下面列出了两张虚表，第一张表是vbptr指向的表，8表示{vbptr}与{vfptr}的偏移；第二张表是vfptr指向的表，-8指明了这张表所对应的虚指针位于内存的偏移量**。

DerivedClass2的内存分布类似于DerivedClass1，同样会有两个虚指针，分别指向两张虚表（第二张是虚基类表）。

**下面来仔细看一下DerivedDerivedClass的内存分布，这里面有三个虚指针了**，但base却只有一份。第一张虚表是内含DerivedClass1的，20表示它的虚指针{vbptr}离虚基表指针{vfptr}的距离，第二张虚表是内含DerivedClass2的，12表示它的虚指针{vbptr}离虚基表指针{vfptr}的距离，最后一张表是虚基表，-20指明了它对应的虚指针{vfptr}在内存中的偏移。



虚继承的作用是**减少了对基类的重复，代价是增加了更多的虚表指针**。

补充：**菱形继承**

![image-20220828213433136](assets/image-20220828213433136.png)

```c
class Base
{
	int a;
};

class DerivedClass1 : public Base
{
	int b;
};

class DerivedClass2 : public Base
{
	int c;
};

class DerivedDerivedClass : public DerivedClass1, public DerivedClass2
{
	int d;
};

int main()
{
	DerivedDerivedClass d;
	return 0;
}
```

内存布局：

```c
1>class Base	size(4):
1>	+---
1> 0	| a
1>	+---
1>class DerivedClass1	size(8):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | a
1>	| +---
1> 4	| b
1>	+---
1>class DerivedClass2	size(8):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | a
1>	| +---
1> 4	| c
1>	+---
1>class DerivedDerivedClass	size(20):
1>	+---
1> 0	| +--- (base class DerivedClass1)
1> 0	| | +--- (base class Base)
1> 0	| | | a
1>	| | +---
1> 4	| | b
1>	| +---
1> 8	| +--- (base class DerivedClass2)
1> 8	| | +--- (base class Base)
1> 8	| | | a
1>	| | +---
1>12	| | c
1>	| +---
1>16	| d
1>	+---
```

首先排布DerivedClass1和DerivedClass2父类，最后排布子类的字段d。



下面总结一下（当基类有虚函数时）：

***1. 每个类都有虚指针和虚表；\***

***2. 如果不是虚继承，那么子类将父类的虚指针继承下来，并指向自身的虚表（发生在对象构造时）。有多少个虚函数，虚表里面的项就会有多少。多重继承时，可能存在多个的基类虚表与虚指针；\***

***3. 如果是虚继承，那么子类会有两份虚指针，一份指向自己的虚表，另一份指向虚基表，多重继承时虚基表与虚基表指针有且只有一份。\***

###  4.17 类的一些问题

重写：是[子类](https://so.csdn.net/so/search?q=子类&spm=1001.2101.3001.7020)对父类的允许访问的方法的实现过程进行重新编写, **==返回值和形参都不能改变==**。**即外壳不变，核心重写！**

现在我做出一个约定，若子类重新实现了父类的函数，且该父类函数不是虚函数，那么我称之为重写。

​                                       若子类重新实现了父类的函数，且该父类函数是虚函数，那么我称之为覆写。

无论是重写还是覆写，返回值和形参都是不能改变的，我只想借这两个名字区分子类重新实现的函数是否为虚函数

另，若子类重新实现了父类的该函数(无论是重写还是覆写)，会隐藏父类中的所有同名的函数。若此时父类的存在重载的函数，子类并未重新实现该重载的函数，然后你又去调用这个重载了的函数，那么会编译错误，其中一个解决办法是加上父类作用域来调用。

无多态：

```c
